<?xml version="1.0" ?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="x.1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,512,1024"/>
			<rt_info>
				<attribute name="fused_names" value="x.1" version="0"/>
				<attribute name="old_api_map_element_type" value="f16" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="x.1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_6833_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_6833" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_6833" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Subtract_6834" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Subtract_6834" version="0"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_93321_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="16, 3, 3, 3" size="864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_93321" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_6835, Convolution_347, Divide_6836, Split_215, onnx::Conv_338, onnx::Conv_821" version="0"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Convolution_347" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_6835, Convolution_347, Divide_6836, Split_215, onnx::Conv_338, onnx::Conv_821" version="0"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_367_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="870" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_367" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="input.3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_366, Reshape_367, input.3" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.3" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_395_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="902" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="11" name="Constant_395" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_395" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="Constant_396_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="904" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="13" name="Constant_396" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_396" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="onnx::Mul_341" type="HardSigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Mul_341" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32"/>
				<port id="2" precision="FP32"/>
			</input>
			<output>
				<port id="3" names="onnx::Mul_341" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="onnx::Shape_342" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Shape_342" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Shape_342" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx::Sub_351" type="Const" version="opset1">
			<data element_type="i64" offset="906" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Sub_351" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Sub_351" precision="I64"/>
			</output>
		</layer>
		<layer id="17" name="onnx::Gather_346" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Gather_343, onnx::Gather_346" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Gather_343,onnx::Gather_346" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="onnx::Gather_347" type="Const" version="opset1">
			<data element_type="i64" offset="914" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Gather_347" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Gather_347" precision="I64"/>
			</output>
		</layer>
		<layer id="19" name="Constant_405" type="Const" version="opset1">
			<data element_type="i64" offset="922" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_405" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="20" name="onnx::Sub_348" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_405, onnx::Gather_347, onnx::Sub_348" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="onnx::Sub_348" precision="I64"/>
			</output>
		</layer>
		<layer id="21" name="onnx::Div_352" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_352, onnx::Sub_351" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Div_352" precision="I64"/>
			</output>
		</layer>
		<layer id="22" name="onnx::Div_353" type="Const" version="opset1">
			<data element_type="i64" offset="930" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_353" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Div_353" precision="I64"/>
			</output>
		</layer>
		<layer id="23" name="onnx::Cast_354" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Cast_354, onnx::Cast_355, onnx::Div_353, onnx::Unsqueeze_356" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Cast_354,onnx::Cast_355,onnx::Unsqueeze_356" precision="I64"/>
			</output>
		</layer>
		<layer id="24" name="Constant_438" type="Const" version="opset1">
			<data element_type="i64" offset="922" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_438" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="onnx::Concat_376" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Constant_438, onnx::Concat_376" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Concat_376" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="onnx::Div_357" type="Const" version="opset1">
			<data element_type="i64" offset="930" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_357" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Div_357" precision="I64"/>
			</output>
		</layer>
		<layer id="27" name="onnx::Cast_358" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Cast_358, onnx::Cast_359, onnx::Div_357, onnx::Sub_360" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Cast_358,onnx::Cast_359,onnx::Sub_360" precision="I64"/>
			</output>
		</layer>
		<layer id="28" name="onnx::Unsqueeze_361" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Unsqueeze_361" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Unsqueeze_361" precision="I64"/>
			</output>
		</layer>
		<layer id="29" name="Constant_440" type="Const" version="opset1">
			<data element_type="i64" offset="922" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_440" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="onnx::Concat_377" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Constant_440, onnx::Concat_377" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Concat_377" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="onnx::Sub_349" type="Const" version="opset1">
			<data element_type="i64" offset="938" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Sub_349" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Sub_349" precision="I64"/>
			</output>
		</layer>
		<layer id="32" name="onnx::Gather_344" type="Const" version="opset1">
			<data element_type="i64" offset="930" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Gather_344" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Gather_344" precision="I64"/>
			</output>
		</layer>
		<layer id="33" name="Constant_401" type="Const" version="opset1">
			<data element_type="i64" offset="922" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_401" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="34" name="onnx::Sub_345" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_401, onnx::Gather_344, onnx::Sub_345" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="onnx::Sub_345" precision="I64"/>
			</output>
		</layer>
		<layer id="35" name="onnx::Div_350" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_350, onnx::Sub_349" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Div_350" precision="I64"/>
			</output>
		</layer>
		<layer id="36" name="onnx::Div_362" type="Const" version="opset1">
			<data element_type="i64" offset="930" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_362" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Div_362" precision="I64"/>
			</output>
		</layer>
		<layer id="37" name="onnx::Cast_363" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Cast_363, onnx::Cast_364, onnx::Div_362, onnx::Unsqueeze_365" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Cast_363,onnx::Cast_364,onnx::Unsqueeze_365" precision="I64"/>
			</output>
		</layer>
		<layer id="38" name="Constant_442" type="Const" version="opset1">
			<data element_type="i64" offset="922" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_442" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="onnx::Concat_378" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Constant_442, onnx::Concat_378" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Concat_378" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="onnx::Div_366" type="Const" version="opset1">
			<data element_type="i64" offset="930" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_366" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Div_366" precision="I64"/>
			</output>
		</layer>
		<layer id="41" name="onnx::Cast_367" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Cast_367, onnx::Cast_368, onnx::Div_366, onnx::Sub_369" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Cast_367,onnx::Cast_368,onnx::Sub_369" precision="I64"/>
			</output>
		</layer>
		<layer id="42" name="onnx::Unsqueeze_370" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Unsqueeze_370" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Unsqueeze_370" precision="I64"/>
			</output>
		</layer>
		<layer id="43" name="Constant_444" type="Const" version="opset1">
			<data element_type="i64" offset="922" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_444" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="onnx::Concat_379" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Constant_444, onnx::Concat_379" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Concat_379" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="onnx::Cast_380" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Cast_380, onnx::Concat_388" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Cast_380,onnx::Concat_388" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx::Concat_389" type="Const" version="opset1">
			<data element_type="i64" offset="946" shape="4" size="32"/>
			<output>
				<port id="0" names="onnx::Concat_389" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="onnx::Reshape_390" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Concat_389, onnx::ConstantOfShape_387, onnx::Gather_382, onnx::Reshape_390, onnx::Sub_383, onnx::Sub_386" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Reshape_390" precision="I64">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="onnx::Reshape_391" type="Const" version="opset1">
			<data element_type="i64" offset="978" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Reshape_391" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Reshape_391" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="onnx::Slice_392" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Reshape_391, onnx::Slice_392" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Slice_392" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Slice_394" type="Const" version="opset1">
			<data element_type="i64" offset="994" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Slice_393, onnx::Slice_394, onnx::Slice_395, onnx::Slice_396, onnx::Transpose_397" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Slice_394" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="onnx::Slice_395" type="Const" version="opset1">
			<data element_type="i64" offset="1002" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Slice_393, onnx::Slice_394, onnx::Slice_395, onnx::Slice_396, onnx::Transpose_397" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Slice_395" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx::Slice_396" type="Const" version="opset1">
			<data element_type="i64" offset="994" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Slice_393, onnx::Slice_394, onnx::Slice_395, onnx::Slice_396, onnx::Transpose_397" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Slice_396" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="onnx::Transpose_397" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="" end_mask="0" new_axis_mask="" shrink_axis_mask=""/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Slice_393, onnx::Slice_394, onnx::Slice_395, onnx::Slice_396, onnx::Transpose_397" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Transpose_397" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_498" type="Const" version="opset1">
			<data element_type="i64" offset="1010" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_498" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="onnx::Reshape_398" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Constant_498, onnx::Reshape_398" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Reshape_398" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="onnx::Reshape_399" type="Const" version="opset1">
			<data element_type="i64" offset="994" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Reshape_399" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Reshape_399" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Cast_400" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Cast_400, onnx::Pad_401, onnx::Reshape_399" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Cast_400,onnx::Pad_401" precision="I64">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_509" type="Const" version="opset1">
			<data element_type="i64" offset="922" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_509" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="59" name="Split_510" type="Split" version="opset1">
			<data num_splits="2"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_509, Split_510" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="onnx::Pad_402_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1026" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="61" name="onnx::Pad_402" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="onnx::Pad_402" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" names="onnx::Pad_402" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="onnx::Conv_403" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_403" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" names="onnx::Conv_403" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>513</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_899_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1028" shape="16, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_899" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="GroupConvolution_965" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="GroupConvolution_965, Reshape_899" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>513</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_985_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1316" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_985" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="input.11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_984, Reshape_985, input.11" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.11" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::ReduceMean_406" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::ReduceMean_406" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::ReduceMean_406" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_1014" type="Const" version="opset1">
			<data element_type="i64" offset="1348" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1014" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="input.15" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" value="input.15" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.15" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="encoder.model.blocks.0.0.se.conv_reduce.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1364" shape="8, 16, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="encoder.model.blocks.0.0.se.conv_reduce.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="encoder.model.blocks.0.0.se.conv_reduce.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="encoder.model.blocks.0.0.se.conv_reduce.weight" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Convolution_1016" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_1016" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_1036_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1620" shape="1, 8, 1, 1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_1036" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="input.19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_1035, Reshape_1036, input.19" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.19" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx::Conv_409" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_409" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_409" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="encoder.model.blocks.0.0.se.conv_expand.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1636" shape="16, 8, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="encoder.model.blocks.0.0.se.conv_expand.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="encoder.model.blocks.0.0.se.conv_expand.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="encoder.model.blocks.0.0.se.conv_expand.weight" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Convolution_1065" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_1065" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_1085_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1892" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Reshape_1085" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="input.23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_1084, Reshape_1085, input.23" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.23" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_1113_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="902" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="86" name="Constant_1113" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_1113" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="Constant_1114_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="904" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="88" name="Constant_1114" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_1114" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="onnx::Mul_411" type="HardSigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Mul_411" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32"/>
				<port id="2" precision="FP32"/>
			</input>
			<output>
				<port id="3" names="onnx::Mul_411" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="input.27" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="input.27" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.27" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx::Conv_827_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="1924" shape="16, 16, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="onnx::Conv_827" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="onnx::Conv_827" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_827" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Convolution_1117" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_1117" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_1137_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="2436" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_1137" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="input.35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_1136, Reshape_1137, input.35" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.35" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="onnx::Conv_830_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="2468" shape="72, 16, 1, 1" size="2304"/>
			<output>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx::Conv_830" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="onnx::Conv_830" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_830" precision="FP32">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Convolution_1165" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_1165" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Reshape_1185_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="4772" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_1185" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="input.43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_1184, Reshape_1185, input.43" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.43" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="onnx::Shape_417" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="onnx::Shape_417" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Shape_417" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="onnx::Sub_426" type="Const" version="opset1">
			<data element_type="i64" offset="938" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Sub_426" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Sub_426" precision="I64"/>
			</output>
		</layer>
		<layer id="105" name="onnx::Gather_421" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Gather_418, onnx::Gather_421" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Gather_418,onnx::Gather_421" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="onnx::Gather_422" type="Const" version="opset1">
			<data element_type="i64" offset="914" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Gather_422" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="onnx::Gather_422" precision="I64"/>
			</output>
		</layer>
		<layer id="107" name="Constant_1220" type="Const" version="opset1">
			<data element_type="i64" offset="922" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1220" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="108" name="onnx::Sub_423" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" value="Constant_1220, onnx::Gather_422, onnx::Sub_423" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="onnx::Sub_423" precision="I64"/>
			</output>
		</layer>
		<layer id="109" name="onnx::Div_427" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_427, onnx::Sub_426" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="onnx::Div_427" precision="I64"/>
			</output>
		</layer>
		<layer id="110" name="onnx::Div_428" type="Const" version="opset1">
			<data element_type="i64" offset="930" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Div_428" version="0"/>
			</rt_info>
			<output>
